*MVE and Reproducing*
Jacking into good/index.clj and evaluating the buffer with C-c C-k
works as expected.

Jacking into bad/index.clj and evaluating the buffer with C-c C-k
results in a nasty exception. I've inserted the exception at the
bottom of this file.

The exception only occurs when evaluating from within CIDER.
=clj index.clj= works as desired.

good/ and bad/ are the same except bad requires [sail.core :as sail]:

#+begin_src shell :results output
  diff good bad
#+end_src

#+RESULTS:
#+begin_example
diff good/deps.edn bad/deps.edn
2c2,3
<         io.replikativ/datahike {:mvn/version "0.6.1559"}}}
---
>         io.replikativ/datahike {:mvn/version "0.6.1559"}
>         com.hypalynx/sail {:mvn/version "0.8.15"}}}
diff good/index.clj bad/index.clj
1c1,2
< (require '[datahike.api :as d])
---
> (require '[datahike.api :as d]
>          '[sail.core :as sail])
5a7
>
#+end_example

*Context*
I'm able to use datahike along with other libraries, no problem. I
just wanted to try out sail, so my personal solution to this problem
is to just not use sail.

The stacktrace below came from CIDER 1.13.1. Afterwards I upgraded to
CIDER 1.14 snapshot and tested again. The issue did not go away.

|               | *Version*           |
|---------------+---------------------|
| *Emacs*       | 29.2                |
| *OS*          | macOS Sonoma 14.2.1 |
| *Clojure CLI* | 1.11.1.1435         |
| *JDK*         | Temurin-21.0.1+12   |

*Exception*
#+begin_quote
        ReentrantLock.java:  180  java.util.concurrent.locks.ReentrantLock$Sync/tryRelease
AbstractQueuedSynchronizer.java: 1059  java.util.concurrent.locks.AbstractQueuedSynchronizer/release
        ReentrantLock.java:  494  java.util.concurrent.locks.ReentrantLock/unlock
         InternalLock.java:   78  jdk.internal.misc.InternalLock/unlock
        StreamEncoder.java:  203  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
          PrintStream.java:  464  java.io.PrintStream/implFlush
          PrintStream.java:  450  java.io.PrintStream/flush
        StreamEncoder.java:  412  sun.nio.cs.StreamEncoder/implFlush
        StreamEncoder.java:  214  sun.nio.cs.StreamEncoder/lockedFlush
        StreamEncoder.java:  201  sun.nio.cs.StreamEncoder/flush
   OutputStreamWriter.java:  262  java.io.OutputStreamWriter/flush
                   out.clj:  147  cider.nrepl.middleware.out/print-stream/fn
#+end_quote
